vlm/base/Documents/бит_АктОБраке.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>бит_АктОБраке</Name>
			<Comment>ЛТ9.2</Comment>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.бит_БракВозвратСрезкаПродукции</xr:Item>
				<xr:Item>InformationRegister.бит_ИсторияИзмененийСсогласованияАктовОБраке</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_СтатусыОБраке</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Цех</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Участок</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Смена</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СменноеЗадание</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СменныйМастер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОперацияОбнаружения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ОперацияОбнаружения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаказНаПроизводство</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаПроизводство2_2</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОтхода</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачатоСогласование</Name>
					<Comment>Первыйбит ЛТ24 ЛапшовГ "GVLapshov@1cbit.ru" 06.012.2024</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоступностьФормы</Name>
					<Comment>Первыйбит ЛТ24 ЛапшовГ "GVLapshov@1cbit.ru" 06.012.2024</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаУстановкиСтатуса</Name>
					<Comment>Первыйбит ЛТ24 ЛапшовГ "GVLapshov@1cbit.ru" 06.012.2024</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРегистрацииСтатуса</Name>
					<Comment>Первыйбит ЛТ24 ЛапшовГ "GVLapshov@1cbit.ru" 06.012.2024</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущийСтатус</Name>
					<Comment>Первыйбит ЛТ24 ЛапшовГ "GVLapshov@1cbit.ru" 06.012.2024</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.бит_СтатусыОБраке</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УспешностьСогласования</Name>
					<Comment>Первыйбит ЛТ24 ЛапшовГ "GVLapshov@1cbit.ru" 06.012.2024</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Исполнитель</Name>
					<Comment>Первыйбит ЛТ24 ЛапшовГ "GVLapshov@1cbit.ru" 06.012.2024</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИтогоКУдержаниюВосстановление</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИтогоКУдержаниюОтходы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИтогоКУдержаниюПеремаркировка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбщийУщербКУдержанию</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДанныеОБраке</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидНесоответствия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_ВидыНесоответствия</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Отходы</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Восстановление</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Виновник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Отходы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Материал</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПрямыеЗатраты</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтоимостьВозможногоИспользования</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаПлановоУчетная</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаВозможногоИспользования</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КУдержанию</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Восстановление</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Материал</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидОперации</Name>
							<Type>
								<v8:Type>cfg:EnumRef.бит_ВидыОперацийВосстановления</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПричиныБрака</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПричинаБрака</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_ПричиныБрака</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Пояснение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Перемаркировка</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НоменклатураЗабракованная</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПеремаркированоВ</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>6</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПолнаяСебестоимостьЗабракованнойНоменклатуры</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПолнаяСебестоимостьПеремаркированнойНоменклатуры</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КУдержанию</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

vlm/base/Documents/бит_АктОБраке/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
#Область ПрограммныйИнтерфейс
#Область ДляВызоваИзДругихПодсистем
Процедура ДобавитьКомандыОтчетов(КомандыОтчетов, Параметры) Экспорт  
	//Первыйбит ЛТ24 ЛапшовГ "GVLapshov@1cbit.ru" 06.12.2024 +
	КомандаОтчет = Отчеты.бит_ИсторияИзмененийАктОБраке.ДобавитьКомандуОтчета(КомандыОтчетов, Параметры);
	Если КомандаОтчет <> Неопределено Тогда
		КомандаОтчет.ВидимостьВФормах = "ФормаДокумента,ФормаСписка";; 
		КомандаОтчет.Порядок = 1;
	КонецЕсли;
    //Первыйбит ЛТ24 ЛапшовГ "GVLapshov@1cbit.ru" 06.12.2024 -
КонецПроцедуры
#КонецОбласти 

#Область Печать
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	//Первыйбит ЛТ9.9 ЛапшовГ "GVLapshov@1cbit.ru" 14.03.2025 + 
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "бит_АктОБраке";
	КомандаПечати.Представление = НСтр("ru = '(бит) Акт о браке'"); 
	//Первыйбит ЛТ9.9 ЛапшовГ "GVLapshov@1cbit.ru" 14.03.2025 -
	
КонецПроцедуры

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	//Первыйбит ЛТ9.9 ЛапшовГ "GVLapshov@1cbit.ru" 14.03.2025 +
	ПечатнаяФорма = УправлениеПечатью.СведенияОПечатнойФорме(КоллекцияПечатныхФорм, "бит_АктОБраке");
	Если ПечатнаяФорма <> Неопределено Тогда
		
		Заголовок = НСтр("ru = '(бит) Акт о браке'");
		МодульУправлениеПечатью = ОбщегоНазначения.ОбщийМодуль("УправлениеПечатью");
		МодульУправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		КоллекцияПечатныхФорм,
		"бит_АктОБраке", 
		Заголовок,
		бит_СформироватьПечатнуюФормуАктОБраке(МассивОбъектов),
		,
		"Документ.бит_АктОБраке.бит_ПФMXL_АктОБраке");
	КонецЕсли; 
	//Первыйбит ЛТ9.9 ЛапшовГ "GVLapshov@1cbit.ru" 14.03.2025 -

КонецПроцедуры   

Функция бит_СформироватьПечатнуюФормуАктОБраке(МассивОбъектов)
	
	//Первыйбит ЛТ9.9 ЛапшовГ "GVLapshov@1cbit.ru" 14.03.2025 +
	
	УстановитьПривилегированныйРежим(Истина);  
	ПараметрыПечати = ИСТИНА;
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб = Истина;
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	
	ТабличныйДокумент.КлючПараметровПечати = "бит_АктОБраке";
	
	Выборка = ВыборкаДанныхДляПечати(МассивОбъектов);
	
	ВыборкаШапка = Выборка.ВыборкаШапка;
			
	Если ВыборкаШапка.Количество() > 1 Тогда
		ТекстСообщения = "По акту не может быть забраковано больше одного изделия!"; 
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		Возврат Неопределено; 
	КонецЕсли;	
    
	Макет = ПолучитьМакет("бит_ПФMXL_АктОБраке");

	//Шапка
	ВыборкаШапка = ВыборкаШапка[0];
	
	ПричиныБрака = ВыборкаШапка.Ссылка.ПричиныБрака;	
	
	ОбластьШапка 							= Макет.ПолучитьОбласть("Шапка");
	//ОбластьШапка.Параметры.Номер 	= ВыборкаШапка.Номер;
	 
	//ОбластьШапка.Параметры.Цех 	= ВыборкаШапка.Цех; 
	//ОбластьШапка.Параметры.Участок 	= ВыборкаШапка.Участок; 
	//ОбластьШапка.Параметры.Смена 	= ВыборкаШапка.Смена; 
	//ОбластьШапка.Параметры.МаркаИзделия 	= ВыборкаШапка.МаркаИзделия; 
	//ОбластьШапка.Параметры.ОперацияОбнаружения 	= ВыборкаШапка.ОперацияОбнаружения; 
	//ОбластьШапка.Параметры.ТабНомер 	= ВыборкаШапка.ТабНомер;  
	//ОбластьШапка.Параметры.Сотрудник 	= ВыборкаШапка.Сотрудник;    	
	ЗаполнитьЗначенияСвойств(ОбластьШапка.Параметры, ВыборкаШапка);
	ОбластьШапка.Параметры.Дата 	= Формат(ВыборкаШапка.Дата, "ДЛФ=Д");
	
	ТабличныйДокумент.Вывести(ОбластьШапка);
	
	ОбластьПустаяСтрока 					= Макет.ПолучитьОбласть("ПустаяСтрока");
	ТабличныйДокумент.Вывести(ОбластьПустаяСтрока);
	
	ОбластьШапкаТЧДанныеОБраке 				= Макет.ПолучитьОбласть("ШапкаТЧДанныеОБраке");
	ТабличныйДокумент.Вывести(ОбластьШапкаТЧДанныеОБраке);
	
	ОбластьСтрокаТЧДанныеОБраке 			= Макет.ПолучитьОбласть("СтрокаТЧДанныеОБраке");
	//ОбластьСтрокаТЧДанныеОБраке.Параметры.НомерБарабана 	= ВыборкаШапка.НомерБарабана; 
	
	//ОбластьСтрокаТЧДанныеОБраке.Параметры.ВидБрака 	= ВыборкаШапка.ВидБрака;      
	//ОбластьСтрокаТЧДанныеОБраке.Параметры.Количество 	= ВыборкаШапка.Количество; 
	//ОбластьСтрокаТЧДанныеОБраке.Параметры.ЕдиницаИзмерения 	= ВыборкаШапка.ЕдиницаИзмерения; 
	//ОбластьСтрокаТЧДанныеОБраке.Параметры.Отходы 	= ВыборкаШапка.Отходы;    
	//ОбластьСтрокаТЧДанныеОБраке.Параметры.Восстановление 	= ВыборкаШапка.Восстановление; 
	//ОбластьСтрокаТЧДанныеОБраке.Параметры.ПослеРазбраковки 	= ВыборкаШапка.ПослеРазбраковки; 
	//ОбластьСтрокаТЧДанныеОБраке.Параметры.Виновник 	= ВыборкаШапка.Виновник;   
	ЗаполнитьЗначенияСвойств(ОбластьСтрокаТЧДанныеОБраке.Параметры, ВыборкаШапка);
	ТабличныйДокумент.Вывести(ОбластьСтрокаТЧДанныеОБраке);

	//КалькуляцияБракабезЗП  
	ВыборкаОтход = Выборка.ВыборкаОтход;
	ВыборкаВосстановление = Выборка.ВыборкаВосстановление;
	
	ТабличныйДокумент.Вывести(ОбластьПустаяСтрока);
	ОбластьШапкаТЧКББезЗП 					= Макет.ПолучитьОбласть("ШапкаТЧКББезЗП");
	ТабличныйДокумент.Вывести(ОбластьШапкаТЧКББезЗП);
    ОбластьШапкаТЧКББезЗПОтходы 			= Макет.ПолучитьОбласть("ШапкаТЧКББезЗПОтходы");
	ОбластьШапкаТЧКББезЗПОтходы.Параметры.ВидОтходов 	= ?(ЗначениеЗаполнено(ВыборкаШапка.ВидОтхода), ВыборкаШапка.ВидОтхода , "без отходов");
    ТабличныйДокумент.Вывести(ОбластьШапкаТЧКББезЗПОтходы); 
	
	ОбластьСтрокаТЧКББезЗПОтходы 			= Макет.ПолучитьОбласть("СтрокаТЧКББезЗПОтходы");
	ОтходыКоличество = 0;
	ОтходыСуммаПлановоУчетная = 0;
	ОтходыСуммаВозможногоИспользования = 0;
	КУдержанию = 0;
	Если ВыборкаОтход.Количество() = 0 Тогда
		ТабличныйДокумент.Вывести(ОбластьСтрокаТЧКББезЗПОтходы);
	Иначе
		Для Каждого Запись Из ВыборкаОтход Цикл
			ОбластьСтрокаТЧКББезЗПОтходы.Параметры.СтрокаТЧКББезЗПОтходыМатериал 	= Запись.Материал;	
			ОбластьСтрокаТЧКББезЗПОтходы.Параметры.СтрокаТЧКББезЗПОтходыКоличество 	= Запись.Количество;
			ОбластьСтрокаТЧКББезЗПОтходы.Параметры.СтрокаТЧКББезЗПОтходыЕдиницаИзмерения 	= Запись.ЕдиницаИзмерения;
			ОбластьСтрокаТЧКББезЗПОтходы.Параметры.СтрокаТЧКББезЗПОтходыЦенаПлановоУчетная 	= Запись.ЦенаПлановоУчетная;
			ОбластьСтрокаТЧКББезЗПОтходы.Параметры.СтрокаТЧКББезЗПОтходыСуммаПлановоУчетная 	= Запись.СуммаПлановоУчетная;
			//ОбластьСтрокаТЧКББезЗПОтходы.Параметры.СтрокаТЧКББезЗПОтходыСтоимостьВозможногоИспользования 	= Запись.СтоимостьВозможногоИспользования;
			ОбластьСтрокаТЧКББезЗПОтходы.Параметры.СтрокаТЧКББезЗПОтходыСуммаВозможногоИспользования 	= Запись.СуммаВозможногоИспользования;
			ОбластьСтрокаТЧКББезЗПОтходы.Параметры.КУдержанию 	= Запись.КУдержанию;
			ТабличныйДокумент.Вывести(ОбластьСтрокаТЧКББезЗПОтходы);
			ОтходыКоличество = ОтходыКоличество + Запись.Количество;
			ОтходыСуммаПлановоУчетная = ОтходыСуммаПлановоУчетная + Запись.СуммаПлановоУчетная;
			ОтходыСуммаВозможногоИспользования = ОтходыСуммаВозможногоИспользования +  Запись.СуммаВозможногоИспользования;
			//КУдержанию = КУдержанию + Запись.СуммаПлановоУчетная - Запись.СуммаВозможногоИспользования;
			КУдержанию = КУдержанию + Запись.КУдержанию; 
		КонецЦикла;
	КонецЕсли;
	
    ОбластьИтогТЧКББезЗПОтходы 				= Макет.ПолучитьОбласть("ИтогТЧКББезЗПОтходы");
	ОбластьИтогТЧКББезЗПОтходы.Параметры.ИтогТЧКББезЗПОтходыКоличество 	= ОтходыКоличество;
	//ОбластьИтогТЧКББезЗПОтходы.Параметры.ИтогТЧКББезЗПОтходыЕдиницаИзмерения 	= "х";
	//ОбластьИтогТЧКББезЗПОтходы.Параметры.ИтогТЧКББезЗПОтходыЦенаПлановоУчетная 	= "х";
	ОбластьИтогТЧКББезЗПОтходы.Параметры.ИтогТЧКББезЗПОтходыСуммаПлановоУчетная 	= ОтходыСуммаПлановоУчетная;
	//ОбластьИтогТЧКББезЗПОтходы.Параметры.ИтогТЧКББезЗПОтходыСтоимостьВозможногоИспользования 	= "х";
	ОбластьИтогТЧКББезЗПОтходы.Параметры.ИтогТЧКББезЗПОтходыСуммаВозможногоИспользования = ОтходыСуммаВозможногоИспользования;
	ОбластьИтогТЧКББезЗПОтходы.Параметры.ИтогТЧКББезЗПОтходыКУдержанию 	= КУдержанию;
	ТабличныйДокумент.Вывести(ОбластьИтогТЧКББезЗПОтходы);
	
	
	
	
	ВыборкаПеремаркировка = Выборка.ВыборкаПеремаркировка;
	
	КУдержанию = 0;
	
	Пока ВыборкаВосстановление.Следующий() Цикл
				
		ВосстановлениеКоличество = 0;
		ВосстановлениеСуммаПлановоУчетная = 0;
		
		//ОбластьСтрокаТЧКББезЗПВосстановление.Параметры.ВидВосстановления = ВыборкаВосстановление.ВидОперации;
		ОбластьШапкаТЧКББезЗПВосстановление		= Макет.ПолучитьОбласть("ШапкаТЧКББезЗПВосстановление");
		ОбластьШапкаТЧКББезЗПВосстановление.Параметры.ВидВосстановления = ВыборкаВосстановление.ВидОперации;	
		ТабличныйДокумент.Вывести(ОбластьШапкаТЧКББезЗПВосстановление);
		
		ВыборкаДетальныеЗаписи = ВыборкаВосстановление.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			ОбластьСтрокаТЧКББезЗПВосстановление 	= Макет.ПолучитьОбласть("СтрокаТЧКББезЗПВосстановление");
			ОбластьСтрокаТЧКББезЗПВосстановление.Параметры.СтрокаТЧКББезЗПВосстановлениеМатериал 	= ВыборкаДетальныеЗаписи.Материал;
			ОбластьСтрокаТЧКББезЗПВосстановление.Параметры.СтрокаТЧКББезЗПВосстановлениеКоличество 	= ВыборкаДетальныеЗаписи.Количество;
			ОбластьСтрокаТЧКББезЗПВосстановление.Параметры.СтрокаТЧКББезЗПВосстановлениеЕдиницаИзмерения 	= ВыборкаДетальныеЗаписи.ЕдиницаИзмерения;		
			
			ОбластьСтрокаТЧКББезЗПВосстановление.Параметры.СтрокаТЧКББезЗПВосстановлениеСуммаПлановоУчетная 	= ВыборкаДетальныеЗаписи.Сумма;
			ОбластьСтрокаТЧКББезЗПВосстановление.Параметры.КУдержанию 	= ВыборкаДетальныеЗаписи.Сумма;
			ТабличныйДокумент.Вывести(ОбластьСтрокаТЧКББезЗПВосстановление);
			
			ВосстановлениеКоличество = ВосстановлениеКоличество + ВыборкаДетальныеЗаписи.Количество;
			ВосстановлениеСуммаПлановоУчетная = ВосстановлениеСуммаПлановоУчетная + ВыборкаДетальныеЗаписи.Сумма;
			//КонецЦикла; 
			
			КУдержанию = КУдержанию + ВыборкаДетальныеЗаписи.Сумма;
			
		КонецЦикла;
				
	КонецЦикла;
	
	Если ВыборкаПеремаркировка.Количество() <> 0 Тогда
		
		ОбластьШапкаТЧКББезЗПВосстановление		= Макет.ПолучитьОбласть("ШапкаТЧКББезЗПВосстановление");
		ОбластьШапкаТЧКББезЗПВосстановление.Параметры.ВидВосстановления = "перемаркировка";	
		ТабличныйДокумент.Вывести(ОбластьШапкаТЧКББезЗПВосстановление);
		
		Для Каждого Запись Из ВыборкаПеремаркировка Цикл
			ОбластьСтрокаТЧКББезЗПВосстановление 	= Макет.ПолучитьОбласть("СтрокаТЧКББезЗПВосстановление");
			
			ОбластьСтрокаТЧКББезЗПВосстановление.Параметры.СтрокаТЧКББезЗПВосстановлениеМатериал 	= Запись.Материал;
			ОбластьСтрокаТЧКББезЗПВосстановление.Параметры.СтрокаТЧКББезЗПВосстановлениеКоличество 	= Запись.Количество;
			ОбластьСтрокаТЧКББезЗПВосстановление.Параметры.СтрокаТЧКББезЗПВосстановлениеЕдиницаИзмерения 	= Запись.ЕдиницаИзмерения;
			
			ОбластьСтрокаТЧКББезЗПВосстановление.Параметры.СтрокаТЧКББезЗПВосстановлениеСуммаПлановоУчетная	= Запись.ПолнаяСебестоимостьЗабракованнойНоменклатуры;
			ОбластьСтрокаТЧКББезЗПВосстановление.Параметры.КУдержанию 	= Запись.КУдержанию;
			ТабличныйДокумент.Вывести(ОбластьСтрокаТЧКББезЗПВосстановление);
			
			КУдержанию = КУдержанию + Запись.КУдержанию;
			
		КонецЦикла;
		
	КонецЕсли;

	
    ОбластьИтогТЧКББезЗПВосстановление = Макет.ПолучитьОбласть("ИтогТЧКББезЗПВосстановление");
	//ОбластьИтогТЧКББезЗПВосстановление.Параметры.ИтогТЧКББезЗПВосстановлениеКоличество 	= ВосстановлениеКоличество;
	//ОбластьИтогТЧКББезЗПВосстановление.Параметры.ИтогТЧКББезЗПВосстановлениеЕдиницаИзмерения 	= "х";
	//ОбластьИтогТЧКББезЗПВосстановление.Параметры.ИтогТЧКББезЗПВосстановлениеЦенаПлановоУчетная 	= "х";
	ОбластьИтогТЧКББезЗПВосстановление.Параметры.ИтогТЧКББезЗПВосстановлениеСуммаПлановоУчетная = ВосстановлениеСуммаПлановоУчетная;
	ОбластьИтогТЧКББезЗПВосстановление.Параметры.КУдержанию = КУдержанию;
	//ОбластьИтогТЧКББезЗПВосстановление.Параметры.ИтогТЧКББезЗПВосстановлениеСтоимостьВозможногоИспользования 	= "х";
	//ОбластьИтогТЧКББезЗПВосстановление.Параметры.ИтогТЧКББезЗПВосстановлениеСуммаВозможногоИспользования 	= "х";
	//ОбластьИтогТЧКББезЗПВосстановление.Параметры.ИтогТЧКББезЗПВосстановлениеКУдержанию 	= "х";
	ТабличныйДокумент.Вывести(ОбластьИтогТЧКББезЗПВосстановление);

	//КалькуляцияБракаСЗП
	ТабличныйДокумент.Вывести(ОбластьПустаяСтрока);
	
	//Решение
	ТабличныйДокумент.Вывести(ОбластьПустаяСтрока);
	ОбластьРешение 							= Макет.ПолучитьОбласть("Решение"); 
	ТабличныйДокумент.Вывести(ОбластьРешение);
	ТабличныйДокумент.Вывести(ОбластьПустаяСтрока);
	ОбластьТЧРешение 						= Макет.ПолучитьОбласть("ТЧРешение");
	ТабличныйДокумент.Вывести(ОбластьТЧРешение);
	
	//ПричинаБрака 
	ВыборкаПричины = Выборка.ВыборкаПричины; 
	ВинаРаботникаТекст = "";
	ТехнологияТекст = "";
	ОборудованиеТекст = "";
	ДругиеПричиныТекст = "";
	ПереченьТехОперТекст = "";
	
	//Для каждого Запись Из ВыборкаПричины Цикл 
	//	Если Запись.бит_ПричинаБрака = Справочники.бит_ПричиныБрака.бит_ВинаРаботника Тогда
	//		 ВинаРаботникаТекст = ВинаРаботникаТекст + Запись.бит_Пояснение + " ";
	//	ИначеЕсли Запись.бит_ПричинаБрака = Справочники.бит_ПричиныБрака.бит_Технология Тогда
	//		 ТехнологияТекст = ТехнологияТекст + Запись.бит_Пояснение + " ";
	//	ИначеЕсли Запись.бит_ПричинаБрака = Справочники.бит_ПричиныБрака.бит_Оборудование Тогда
	//		 ОборудованиеТекст = ОборудованиеТекст + Запись.бит_Пояснение + " ";
	//	ИначеЕсли Запись.бит_ПричинаБрака = Справочники.бит_ПричиныБрака.бит_ДругиеПричины Тогда
	//		 ДругиеПричиныТекст = ДругиеПричиныТекст + Запись.бит_Пояснение + " ";
	//	ИначеЕсли Запись.бит_ПричинаБрака = Справочники.бит_ПричиныБрака.бит_ПереченьТехнологическихОпераций Тогда	
	//		 ПереченьТехОперТекст = ПереченьТехОперТекст + Запись.бит_Пояснение + " ";
	//	КонецЕсли;	
	//КонецЦикла;
	
	ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
	ТабличныйДокумент.Вывести(ОбластьПустаяСтрока);
    ОбластьШапкаПричинаБрака 				= Макет.ПолучитьОбласть("ШапкаПричинаБрака");
	ТабличныйДокумент.Вывести(ОбластьШапкаПричинаБрака);
	ТабличныйДокумент.Вывести(ОбластьПустаяСтрока);
	
	Для Каждого СтрокаПричиныБрака Из ПричиныБрака Цикл
		Если ЗначениеЗаполнено(СтрокаПричиныБрака.Пояснение) Тогда
			ОбластьСтрокаПричинаБрака 				= Макет.ПолучитьОбласть("ПричинаБрака");
			ОбластьСтрокаПричинаБрака.Параметры.ПричинаБрака = СтрокаПричиныБрака.ПричинаБрака;
			ОбластьСтрокаПричинаБрака.Параметры.Пояснение = СтрокаПричиныБрака.Пояснение;
			ТабличныйДокумент.Вывести(ОбластьСтрокаПричинаБрака);
		КонецЕсли;
	КонецЦикла;
	
	ОбластьСтрокаПричинаБрака 				= Макет.ПолучитьОбласть("ПричинаБрака");
	ТабличныйДокумент.Вывести(ОбластьСтрокаПричинаБрака);
	
	//ОбластьВинаРаботника 					= Макет.ПолучитьОбласть("ВинаРаботника"); 
	//ДлиннаВинаРаботникаТекст = СтрДлина(ВинаРаботникаТекст); 
	//Если ДлиннаВинаРаботникаТекст <= 150 Тогда 
	//	ОбластьВинаРаботника.Параметры.ВинаРаботника1 	= ВинаРаботникаТекст;
	//ИначеЕсли ДлиннаВинаРаботникаТекст > 150 
	//	И ДлиннаВинаРаботникаТекст <= 300 Тогда
	//	ОбластьВинаРаботника.Параметры.ВинаРаботника1 	= Лев(ВинаРаботникаТекст, 150); 
	//	ОбластьВинаРаботника.Параметры.ВинаРаботника2 	= Прав(ВинаРаботникаТекст, ДлиннаВинаРаботникаТекст - 150);
	//ИначеЕсли ДлиннаВинаРаботникаТекст > 300 Тогда
	//	ОбластьВинаРаботника.Параметры.ВинаРаботника1 	= Лев(ВинаРаботникаТекст, 150);	
	//	ОбластьВинаРаботника.Параметры.ВинаРаботника2 	= Сред(ВинаРаботникаТекст, 151, 150);
	//	ОбластьВинаРаботника.Параметры.ВинаРаботника3 	= Прав(ВинаРаботникаТекст, ДлиннаВинаРаботникаТекст - 300);;
	//КонецЕсли;
	//ТабличныйДокумент.Вывести(ОбластьВинаРаботника);
	//
	//ОбластьТехнология 						= Макет.ПолучитьОбласть("Технология"); 
	//ДлиннаТехнологияТекст = СтрДлина(ТехнологияТекст); 
	//Если ДлиннаТехнологияТекст <= 150 Тогда 
	//	ОбластьТехнология.Параметры.Технология1 	= ТехнологияТекст;
	//ИначеЕсли ДлиннаТехнологияТекст > 150 
	//	И ДлиннаТехнологияТекст <= 300 Тогда
	//	ОбластьТехнология.Параметры.Технология1 	= Лев(ТехнологияТекст, 150); 
	//	ОбластьТехнология.Параметры.Технология2 	= Прав(ТехнологияТекст, ДлиннаТехнологияТекст - 150);
	//ИначеЕсли ДлиннаТехнологияТекст > 300 Тогда
	//	ОбластьТехнология.Параметры.Технология1 	= Лев(ТехнологияТекст, 150);	
	//	ОбластьТехнология.Параметры.Технология2 	= Сред(ТехнологияТекст, 151, 150);
	//	ОбластьТехнология.Параметры.Технология3 	= Прав(ТехнологияТекст, ДлиннаТехнологияТекст - 300);;
	//КонецЕсли;
	//ТабличныйДокумент.Вывести(ОбластьТехнология);
	//
	//ОбластьОборудование 					= Макет.ПолучитьОбласть("Оборудование"); 
	//ДлиннаОборудованиеТекст = СтрДлина(ОборудованиеТекст);
	//Если ДлиннаОборудованиеТекст <= 150 Тогда 
	//	ОбластьОборудование.Параметры.Оборудование1 	= ОборудованиеТекст;
	//ИначеЕсли ДлиннаОборудованиеТекст > 150 
	//	И ДлиннаОборудованиеТекст <= 300 Тогда
	//	ОбластьОборудование.Параметры.Оборудование1 	= Лев(ОборудованиеТекст, 150); 
	//	ОбластьОборудование.Параметры.Оборудование2 	= Прав(ОборудованиеТекст, ДлиннаОборудованиеТекст - 150);
	//ИначеЕсли ДлиннаОборудованиеТекст > 300 Тогда
	//	ОбластьОборудование.Параметры.Оборудование1 	= Лев(ОборудованиеТекст, 150);	
	//	ОбластьОборудование.Параметры.Оборудование2 	= Сред(ОборудованиеТекст, 151, 150);
	//	ОбластьОборудование.Параметры.Оборудование3 	= Прав(ОборудованиеТекст, ДлиннаОборудованиеТекст - 300);;
	//КонецЕсли;
	//ТабличныйДокумент.Вывести(ОбластьОборудование);
	//
	//ОбластьДругиеПричины 					= Макет.ПолучитьОбласть("ДругиеПричины");
	//ДлиннаДругиеПричиныТекст = СтрДлина(ДругиеПричиныТекст);
	//Если ДлиннаДругиеПричиныТекст <= 150 Тогда 
	//	ОбластьДругиеПричины.Параметры.ДругиеПричины1 	= ДругиеПричиныТекст;
	//ИначеЕсли ДлиннаДругиеПричиныТекст > 150 
	//	И ДлиннаДругиеПричиныТекст <= 300 Тогда
	//	ОбластьДругиеПричины.Параметры.ДругиеПричины1 	= Лев(ДругиеПричиныТекст, 150); 
	//	ОбластьДругиеПричины.Параметры.ДругиеПричины2 	= Прав(ДругиеПричиныТекст, ДлиннаДругиеПричиныТекст - 150);
	//ИначеЕсли ДлиннаДругиеПричиныТекст > 300 Тогда
	//	ОбластьДругиеПричины.Параметры.ДругиеПричины1 	= Лев(ДругиеПричиныТекст, 150);	
	//	ОбластьДругиеПричины.Параметры.ДругиеПричины2 	= Сред(ДругиеПричиныТекст, 151, 150);
	//	ОбластьДругиеПричины.Параметры.ДругиеПричины3 	= Прав(ДругиеПричиныТекст, ДлиннаДругиеПричиныТекст - 300);;
	//КонецЕсли;
	//ТабличныйДокумент.Вывести(ОбластьДругиеПричины);
	//
	//ОбластьПереченьТехнологическихОпераций 	= Макет.ПолучитьОбласть("ПереченьТехнологическихОпераций"); 
	//ДлиннаПереченьТехОперТекст = СтрДлина(ПереченьТехОперТекст);
	//Если ДлиннаПереченьТехОперТекст <= 150 Тогда 
	//	ОбластьПереченьТехнологическихОпераций.Параметры.ПереченьТехОпер1 	= ПереченьТехОперТекст;
	//ИначеЕсли ДлиннаПереченьТехОперТекст > 150 
	//	И ДлиннаПереченьТехОперТекст <= 300 Тогда
	//	ОбластьПереченьТехнологическихОпераций.Параметры.ПереченьТехОпер1 	= Лев(ПереченьТехОперТекст, 150); 
	//	ОбластьПереченьТехнологическихОпераций.Параметры.ПереченьТехОпер2 	= Прав(ПереченьТехОперТекст, ДлиннаПереченьТехОперТекст - 150);
	//ИначеЕсли ДлиннаПереченьТехОперТекст > 300 Тогда
	//	ОбластьПереченьТехнологическихОпераций.Параметры.ПереченьТехОпер1 	= Лев(ПереченьТехОперТекст, 150);	
	//	ОбластьПереченьТехнологическихОпераций.Параметры.ПереченьТехОпер2 	= Сред(ПереченьТехОперТекст, 151, 150);
	//	ОбластьПереченьТехнологическихОпераций.Параметры.ПереченьТехОпер3 	= Прав(ПереченьТехОперТекст, ДлиннаПереченьТехОперТекст - 300);;
	//КонецЕсли;
	//ТабличныйДокумент.Вывести(ОбластьПереченьТехнологическихОпераций);
	
	//Подвал
	ОбластьПодвал 							= Макет.ПолучитьОбласть("Подвал"); 
	ТабличныйДокумент.Вывести(ОбластьПодвал);

	Возврат ТабличныйДокумент;
	
	//Первыйбит ЛТ9.9 ЛапшовГ "GVLapshov@1cbit.ru" 14.03.2025 -
	
КонецФункции

Функция ВыборкаДанныхДляПечати(МассивОбъектов)
	
	//Первыйбит ЛТ9.9 ЛапшовГ "GVLapshov@1cbit.ru" 14.03.2025 + 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	бит_АктОБраке.Ссылка КАК Ссылка,
		|	бит_АктОБраке.Номер КАК Номер,
		|	бит_АктОБраке.Дата КАК Дата,
		|	бит_АктОБраке.Цех.Наименование КАК Цех,
		|	бит_АктОБраке.Участок.Наименование КАК Участок,
		|	бит_АктОБраке.СменныйМастер КАК Смена,
		|	бит_АктОБракебит_ДанныеОБраке.Номенклатура.Марка КАК МаркаИзделия,
		|	бит_АктОБраке.ОперацияОбнаружения КАК ОперацияОбнаружения,
		|	ВЫБОР
		|		КОГДА бит_АктОБракебит_ДанныеОБраке.Сотрудник ССЫЛКА Справочник.Сотрудники
		|			ТОГДА бит_АктОБракебит_ДанныеОБраке.Сотрудник.Код
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК ТабНомер,
		|	бит_АктОБракебит_ДанныеОБраке.Сотрудник.Наименование КАК Сотрудник,
		|	бит_АктОБракебит_ДанныеОБраке.ВидНесоответствия КАК ВидБрака,
		|	бит_АктОБракебит_ДанныеОБраке.Количество КАК Количество,
		|	бит_АктОБракебит_ДанныеОБраке.Номенклатура КАК Номенклатура,
		|	бит_АктОБракебит_ДанныеОБраке.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	бит_АктОБракебит_ДанныеОБраке.Отходы КАК Отходы,
		|	бит_АктОБракебит_ДанныеОБраке.Восстановление КАК Восстановление,
		|	ВЫБОР
		|		КОГДА бит_АктОБракебит_ДанныеОБраке.Виновник ССЫЛКА Справочник.Сотрудники
		|			ТОГДА СТРОКА(бит_АктОБракебит_ДанныеОБраке.Виновник.Код) + "" "" + СТРОКА(бит_АктОБракебит_ДанныеОБраке.Виновник.Наименование)
		|		ИНАЧЕ бит_АктОБракебит_ДанныеОБраке.Виновник
		|	КОНЕЦ КАК Виновник,
		|	бит_АктОБраке.ВидОтхода КАК ВидОтхода
		|ИЗ
		|	Документ.бит_АктОБраке КАК бит_АктОБраке
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.бит_АктОБраке.ДанныеОБраке КАК бит_АктОБракебит_ДанныеОБраке
		|		ПО (бит_АктОБракебит_ДанныеОБраке.Ссылка = бит_АктОБраке.Ссылка)
		|ГДЕ
		|	бит_АктОБраке.Ссылка В(&МассивОбъектов)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	бит_АктОБракебит_Отходы.Материал КАК Материал,
		|	бит_АктОБракебит_Отходы.Количество КАК Количество,
		|	бит_АктОБракебит_Отходы.Материал.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	бит_АктОБракебит_Отходы.ПрямыеЗатраты КАК ЦенаПлановоУчетная,
		|	бит_АктОБракебит_Отходы.СуммаПлановоУчетная КАК СуммаПлановоУчетная,
		|	бит_АктОБракебит_Отходы.СтоимостьВозможногоИспользования КАК СтоимостьВозможногоИспользования,
		|	бит_АктОБракебит_Отходы.СуммаВозможногоИспользования КАК СуммаВозможногоИспользования,
		|	бит_АктОБракебит_Отходы.КУдержанию КАК КУдержанию
		|ИЗ
		|	Документ.бит_АктОБраке.Отходы КАК бит_АктОБракебит_Отходы
		|ГДЕ
		|	бит_АктОБракебит_Отходы.Ссылка В(&МассивОбъектов)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	бит_АктОБракебит_Восстановление.Материал КАК Материал,
		|	бит_АктОБракебит_Восстановление.Количество КАК Количество,
		|	бит_АктОБракебит_Восстановление.Материал.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	бит_АктОБракебит_Восстановление.Сумма КАК Сумма,
		|	бит_АктОБракебит_Восстановление.ВидОперации КАК ВидОперации
		|ИЗ
		|	Документ.бит_АктОБраке.Восстановление КАК бит_АктОБракебит_Восстановление
		|ГДЕ
		|	бит_АктОБракебит_Восстановление.Ссылка В(&МассивОбъектов)
		|ИТОГИ ПО
		|	ВидОперации
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	бит_АктОБракебит_ПричиныБрака.ПричинаБрака КАК бит_ПричинаБрака,
		|	бит_АктОБракебит_ПричиныБрака.Пояснение КАК бит_Пояснение
		|ИЗ
		|	Документ.бит_АктОБраке.ПричиныБрака КАК бит_АктОБракебит_ПричиныБрака
		|ГДЕ
		|	бит_АктОБракебит_ПричиныБрака.Ссылка В(&МассивОбъектов)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	бит_АктОБракеПеремаркировка.НоменклатураЗабракованная КАК Материал,
		|	бит_АктОБракеПеремаркировка.Количество КАК Количество,
		|	бит_АктОБракеПеремаркировка.НоменклатураЗабракованная.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	бит_АктОБракеПеремаркировка.ПолнаяСебестоимостьЗабракованнойНоменклатуры КАК ПолнаяСебестоимостьЗабракованнойНоменклатуры,
		|	бит_АктОБракеПеремаркировка.КУдержанию КАК КУдержанию
		|ИЗ
		|	Документ.бит_АктОБраке.Перемаркировка КАК бит_АктОБракеПеремаркировка
		|ГДЕ
		|	бит_АктОБракеПеремаркировка.Ссылка В(&МассивОбъектов)";
	
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	ВыборкаШапка =  РезультатЗапроса[0].Выгрузить();
	ВыборкаОтход =  РезультатЗапроса[1].Выгрузить();
	ВыборкаВосстановление = РезультатЗапроса[2].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаПричины = РезультатЗапроса[3].Выгрузить();
	ВыборкаПеремаркировка = РезультатЗапроса[4].Выгрузить();
	
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("ВыборкаШапка", ВыборкаШапка);
	СтруктураДанных.Вставить("ВыборкаОтход", ВыборкаОтход); 
	СтруктураДанных.Вставить("ВыборкаВосстановление", ВыборкаВосстановление);
	СтруктураДанных.Вставить("ВыборкаПричины", ВыборкаПричины);
	СтруктураДанных.Вставить("ВыборкаПеремаркировка", ВыборкаПеремаркировка);
	
	Возврат СтруктураДанных;
	//Первыйбит ЛТ9.9 ЛапшовГ "GVLapshov@1cbit.ru" 14.03.2025 +
	
КонецФункции
#КонецОбласти
#КонецОбласти
#КонецЕсли
